/*
练习5-10.
求4行3列矩阵和3行4列矩阵的乘积。各元素从键盘输入。
*/
 
#include <stdio.h>

int main(void)
{
    int i, j, pro;
    int x[4][3];
    int y[3][4];
    int z[4][4];

    puts("请输入4行3列矩阵的元素的值：");
    for (i = 0; i <4; i++){
        for (j = 0; j < 3; j++){
            printf("x[%d][%d]=", i, j);
            scanf("%d", &x[i][j]);
        }
    }
    
    puts("请输入3行4列矩阵的元素的值：");
    for (i = 0; i < 3; i++){
        for (j = 0; j < 4; j++){
            printf("y[%d][%d]=", i, j);
            scanf("%d", &y[i][j]);
            
        }
    }
    

    puts("两矩阵的乘积是：");
    for (i = 0; i < 4; i++){
        for (j = 0; j < 4; j++){
            z[i][j] = 0;
            for (pro = 0; pro < 3; pro++){
                z[i][j] += x[i][pro] + y[pro][j];  
            }
        }
    }
    //打印出矩阵
    for (i = 0; i < 4; i++){
        for (j = 0; j < 4; j++){
            printf("%4d", z[i][j]);
            putchar(' ');
            
        }
        putchar('\n');
    }

    return 0;
}

/*
请输入4行3列矩阵的元素的值：
x[0][0]=12
x[0][1]=11
x[0][2]=13
x[1][0]=14
x[1][1]=15
x[1][2]=16
x[2][0]=17
x[2][1]=28
x[2][2]=53
x[3][0]=45
x[3][1]=54
x[3][2]=54
请输入3行4列矩阵的元素的值：
y[0][0]=5
y[0][1]=56
y[0][2]=77
y[0][3]=765
y[1][0]=54
y[1][1]=32
y[1][2]=45
y[1][3]=87
y[2][0]=87
y[2][1]=65
y[2][2]=657
y[2][3]=54
两矩阵的乘积是：
 182  189  815  942
 191  198  824  951
 244  251  877 1004
 299  306  932 1059

*/